000100210210       DCL-F COVIDDSP WORKSTN;
000101210207       DCL-F COVIDINFO WORKSTN;
000102210207         EXSR CLEAR;
000103210203       EXFMT RISKFACTOR;
000104210203       DOW NOT(*IN03);
000105210203         IF  Gender = ' ';
000106210203                  *IN95 = *ON ;
000107210203                  EXFMT RISKFACTOR;
000108210203                  *IN95= *OFF;
000109210203                  ITER;
000110210203              ElseIf CVDISEASE =' ';
000111210203                  *IN96=*ON;
000112210203                  EXFMT RISKFACTOR;
000113210203                  *IN96=*OFF;
000114210203                  ITER;
000115210203              ElseIf DIABETES=' ';
000116210203                  *IN98=*ON;
000117210203                  EXFMT RISKFACTOR;
000118210203                  *IN98=*OFF;
000119210203                  ITER;
000120210203               ElseIf RSPDISEASE=' ';
000121210203                 *IN97=*ON;
000122210203                  EXFMT RISKFACTOR;
000123210203                  *IN97=*OFF;
000124210203                  ITER;
000125210204              ElseIf HBPRESSURE='';
000126210203                 *IN99=*ON;
000127210203                  EXFMT RISKFACTOR;
000128210203                  *IN99=*OFF;
000129210203
000130210203         ENDIF;
000131210210           EXSR DetermineRisk;
000132210210            TOTALQ=1+TOTALQ;
000135210203         *IN60=*ON;
000136210203         WRITE RISKFACTOR;
000137210210         EXFMT RISKASSMNT;
000141210203           *IN60=*OFF;
000142210210
000143210210           IF (*IN01=*ON AND *IN03=*OFF);
000144210210             EXFMT CINFO;
000145210210             *IN01=*OFF;
000146210210           ENDIF;
000147210210
000148210210           IF *IN03=*OFF;
000149210210            EXSR CLEAR;
000150210210            EXFMT RISKFACTOR;
000152210210         ENDIF;
000153210203       ENDDO;
000162210203       *INLR = *ON;
000163210203       RETURN;
000164210210       BEGSR DetermineRisk;
000165210210        EXSR AgeFactor;
000166210210
000167210210       ENDSR;
000168210203       BEGSR CLEAR;
000169210203         GENDER='';
000170210203          CVDISEASE='';
000171210203            DIABETES='';
000172210203             RSPDISEASE='';
000173210204             HBPRESSURE='';
000174210210               BIRTHDATE=%DATE();
000176210210
000178210203       ENDSR;
000179210207       BEGSR AgeFactor;
000180210210            AGE= %DIFF(%DATE():BIRTHDATE:*YEARS);
000181210210
000182210207
000183210207         SELECT;
000184210207           WHEN AGE>=80;
000185210210             FRATE=14.800;
000186210207              WHEN AGE>=70;
000187210210                FRATE=8.000;
000188210207                 WHEN AGE>=60;
000189210210                   FRATE=3.600;
000190210207                    WHEN AGE>=50;
000191210210                      FRATE=1.300;
000192210207                       WHEN AGE>=40;
000193210210                         FRATE=0.400;
000194210207                          WHEN AGE>=30;
000195210210                            FRATE=0.250;
000196210207                             WHEN AGE>=20;
000197210210                               FRATE=0.230;
000198210207                                WHEN AGE>=10;
000199210210                                  FRATE=0.200;
000200210207                                   OTHER;
000201210210                                      FRATE=0.100;
000202210207         ENDSL;
000203210207         IF GENDER='F';
000204210210           FRATE=FRATE-0.500;
000205210207         ENDIF;
000206210207
000207210207         IF CVDISEASE='Y';
000208210210            FRATE=0.800+FRATE;
000209210207        ENDIF;
000210210207           IF DIABETES='Y';
000211210210            FRATE=FRATE+0.600;
000212210207        ENDIF;
000213210207               IF HBPRESSURE='Y';
000214210210            FRATE=FRATE+0.300;
000215210207        ENDIF;
000216210207         IF RSPDISEASE='Y';
000217210210            FRATE=FRATE+0.400;
000218210207        ENDIF;
000219210207
000220210207        SELECT;
000221210207          WHEN FRATE>=9.5;
000222210207            COHORT='Group 1';
000223210207            WHEN FRATE>=5.5;
000224210207              COHORT='Group 2';
000225210207                 WHEN FRATE>=3.5;
000226210207              COHORT='Group 3';
000227210207               WHEN FRATE>=1.5;
000228210207              COHORT='Group 4';
000229210207              OTHER;
000230210207                COHORT='Group 5';
000231210207        ENDSL;
000232210207       ENDSR;
000233210203
000234210207
