000100210207             PGM
000101210207             CALL       QGPL/STRJOB
000102210207             ADDLIBLE   BCI433LIB
000103210210             MONMSG     MSGID(CPF2103)
000104210210 DSP:        DSPSYSLVL  *DISPLAY
000105210207             ENDPGM
000106210207
